Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: configurable policy will allow administrators to determine which methods they want to use and in what order the methods should be prioritized.
ja: 設定可能なポリシーによって, どの方法を使ってほしいかやどの方法が優先されるべきかの順番を管理者が決められるようになる.

source: Since we expect that the SSH protocol will be in use for many years in the future, we fear that extensive precomputation and more efficient algorithms to compute the discrete logarithm over a fixed group might pose a security threat to the SSH protocol.
ja: 将来何年にも渡って SSHプロトコルが利用されることを期待しているので, 固定された群に対する広範囲の事前計算と群の上の離散対数を計算するより効率的なアルゴリズムが, SSH プロトコルのセキュリティの脅威になることを恐れている.

source: It is RECOMMENDED that implementers consider the security features as provided by the SNMPv3 framework (see [RFC3410], Section 8), including full support for cryptographic mechanisms for authentication and privacy, such as those found in the User-based Security Model [RFC3414], the Transport Security Model [RFC5591], and the SSH Transport Model described in this document.
ja: SNMPv3 フレームワーク ([RFC3410], 8 節を参照) で提供されるセキュリティの特徴を実装者が考慮するのを推奨する. このフレームワークは,たとえばUser-based Security Model [RFC3414] や Transport Security Model [RFC5591], この文書で記述した SSH トランスポートモデルによって提供される, 認証と機密性の暗号メカニズムを完全に含んでいる.

source: This document uses TDomain Textual Conventions for the SNMP-internal MIB modules defined here for compatibility with the RFC 3413 MIB modules and the RFC 3411 Abstract Service Interfaces.
ja: この文書は RFC 3413 MIB modules と RFC 3411 Abstract Service Interfaces との互換性のために, ここで定義した Domain Textual Conventions for the SNMP-internal MIB modules を用いる.

source: When not in the midst of processing a key exchange, either party may initiate a key re-exchange by sending an SSH_MSG_KEXINIT packet.
ja: 鍵交換を処理する途中でなければ, どちらの側も SSH_MSG_KEXINIT パケットを送ることで鍵の再交換を開始できる.

source: SSH provides the "none" Message Authentication Code (MAC) algorithm, which would allow you to turn off data integrity while maintaining confidentiality.
ja: SSH は, 機密性を維持しつつデータの完全性保護を無効にする "none" メッセージ認証コード (MAC) を提供する.

source: It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP.
ja: このため, これらのオブジェクトへのGET および/また NOTIFY アクセスを制御したり, これらのオブジェクトを SNMP でネットワーク越しに送る場合に場合によってはこれらの値を暗号化することが重要だ.

source: The "aes192-cbc" cipher is the same as above, but with a 192-bit key.
ja: "aes192-cbc" 暗号は, 同様の暗号だが, 192-bit の鍵を使う.

source: The value of 'mac' resulting from the MAC algorithm MUST be transmitted without encryption as the last part of the packet.
ja: MAC アルゴリズムによって計算された 'mac' の値は, パケットの最後の部分に暗号化なしで転送されなければならない.

source: Method
ja: 方法

source: Disconnection Message 'reason code' values MUST be assigned sequentially.
ja: 切断メッセージの 'reason code' の値は, 連続して割り当てられなければならない.

source: The authentication method name for this protocol is "gssapi-keyex".
ja: このプロトコルの認証法名は "gssapi-keyex" だ.

source: As a result, the use of SPNEGO could result in the subversion of the negotiation algorithm for key exchange methods as described in Section 7.1 of [SSH-TRANSPORT] and/or the negotiation algorithm for user authentication methods as described in [SSH-USERAUTH].
ja: 結果として, SPENGO の利用は, [SSH-TRANSPORT] の 7.1 節で記述された鍵交換法 と/もしくは [SSH-USERAUTH] で記述されたユーザ認証法の 交渉アルゴリズムを転覆させる可能性があります.

source: The IANA will not register and will not control names with the at-sign in them.
ja: IANAは, アットマークを含む名前を登録しないし管理しない.

source: On the other hand, each host key must be appropriately certified by a central authority before authorization is possible.
ja: 一方で, それぞれのホスト鍵は, 認証を可能にする前に中央の認証局によって明示的に保証されなければならない.

source: In CBC mode that is the output of the encryption of the previous block.
ja: CBCモードでは, これは前のブロックの暗号化の出力だ.

source: The elliptic curve public keys (points) that must be transmitted are encoded into octet strings before they are transmitted.
ja: 転送される楕円曲線公開鍵(点)は, 転送前に8bit文字列にエンコードする必要がある.

source: The Transport Layer Protocol, described in [RFC4253], requires that a digital signature algorithm (called the "public key algorithm") MUST be used to authenticate the server to the client.
ja: [RFC4253] に記述されているトランスポート層プロトコルは, クライアントにサーバを認証するために("public key algorithm" と呼ばれる) 電子署名アルゴリズムを用いなければならないことを要求している.

source: The strength of RSAES-OAEP is in part dependent on the hash function it uses.
ja: RSAES-OAEP の強さは, 利用するハッシュ関数にある程度依存している.

source: The mpint encoding of K requires a leading zero bit, padding to a whole number of bytes, and a four-byte length field, giving a maximum length in bytes, B = (KLEN-2*HLEN-49+1+7)/8 + 4 = (KLEN-2*HLEN-9)/8 (where "/" denotes integer division rounding down).
ja: K の mpint エンコーディングは, 最初の0のビット(訳注: mpintの表現では正の数は最上位ビットが0)と バイト単位にするためのパディング, 4バイトの長さのフィールドが必要だ. バイトでの最大長は, B = (KLEN-2*HLEN-49+1+7)/8 + 4 = (KLEN-2*HLEN-9)/8 ("/" は, 切り捨てを行なう整数の除算) となる.

source: kex_algorithms Key exchange algorithms were defined above.
ja: kex_algorithms 前述した鍵交換アルゴリズムのリスト

source: If the 'description' string is displayed, the control character filtering discussed in [SSH-ARCH] should be used to avoid attacks by sending terminal control characters.
ja: 'description' 文字列を表示するなら, [SSH-ARCH]での議論のように, 端末の制御文字を利用した攻撃を避けるために制御文字のフィルタを用いる必要がある.

source: The Nagle algorithm + TCP retransmits mean that the two records get coalesced into a single TCP segment.
ja: ナゲールアルゴリズムとTCPの再送で2つのレコードが1つのTCPセグメントに合体された.

source: Figure 1: Key Derivation in Secure Shell
ja: 図 1: セキュアシェルの鍵導出

source: As is noted, the actual instructions to the IANA are in [SSH-NUMBERS].
ja: IANA への実際の指示は [SSH-NUMBERS] にあることに注意.

source: Most signature algorithms include hashing and additional padding (e.g., "ssh-dss" specifies SHA-1 hashing).
ja: 殆どの署名のアルゴリズムは, ハッシュと追加のパディングを含んでいる(たとえば, 'ssh-dss' は SHA-1 ハッシュを指定する).

source: Digital certificates, such as those in X.509 version 3 (X.509v3) format [RFC5280], are used in many corporate and government environments to provide identity management.
ja: 電子証明書(例えば X.509 バージョン 3 (X.509v3) 形式 [RFC5280]のもの)は, ID管理を提供する多くの会社や政府の環境で利用されている.

source: Naturally, if the server does not understand the proposed 'channel type', even if it is a locally defined 'channel type', then the 'reason code' MUST be 0x00000003, as described above.
ja: もちろん, サーバが提案された 'channel type' を理解できない場合は, それがローカルに定義された 'channel type' であっても, 'reason code' は 前述した0x00000003 でなければならない.

source: SSH protects against replay of messages across SSH sessions by ensuring that the cryptographic keys used for encryption and integrity checks are generated afresh for each session.
ja: SSH は, それぞれのセッションに対して暗号化と完全性検査の暗号鍵を新たに生成することを保証することで, SSH のセッションにまたがったメッセージの再送に対して保護を行なう.

source: If tmStateReference does not refer to a cache containing values for tmTransportDomain, tmTransportAddress, tmSecurityName, tmRequestedSecurityLevel, and tmSameSecurity, then increment the snmpSshtmSessionInvalidCaches counter, discard the message, and return the error indication in the statusInformation.
ja: tmStateReference が, キャッシュに含まれる tmTransportDomain と tmTransportAddress, tmSecurityName,tmRequestedSecurityLevel, tmSameSecurity の値を参照していない場合, snmpSshtmSessionInvalidCaches カウンタをインクリメントし, メッセージを捨て,statusInformation の中のエラー表示を返す.

source: Reserved for client protocols:
ja: クライアントプロトコルのための予約:

source: Otherwise, the recipient responds with either SSH_MSG_CHANNEL_SUCCESS, SSH_MSG_CHANNEL_FAILURE, or request-specific continuation messages.
ja: そうでなければ, 受け取り手は SSH_MSG_CHANNEL_SUCCESS ないし SSH_MSG_CHANNEL_FAILURE, もしくは 要求特有の継続メッセージを返す.

source: AES GCM Authenticated Encryption
ja: AES GCM の認証付き暗号化

source: This may be a transient key generated solely for this SSH connection, or it may be re-used for several connections.
ja: このSSH接続のためのみに生成される一時的な鍵でもよいし, いくつかの接続で再利用されてもよい.

source: Please note that the notion of "prove" in the context of [BKN1,BKN2] is that of practice-oriented reductionist security: if an attacker is able to break the symmetric portion of the SSH Transport Protocol using a certain type of attack (e.g., a chosen-ciphertext attack), then the attacker will also be able to break one of the transport protocol's underlying components (e.g., the underlying block cipher or MAC).
ja: 注意: [BKN1, BKN2]の文脈での"証明"の概念は, 実践指向の還元主義者のセキュリティの概念だ. 攻撃者がSSHトランスポートプロトコルの対称部分をなんらかの方法(たとえば選択暗号文攻撃)で破れる場合に 攻撃者はトランスポートプロトコルの基底となっている部分の対称部分(たとえば基底のブロック暗号やMAC)も破れるということだ.

source: However, this authentication method is limited to authentication mechanisms that do not require any special code, such as hardware drivers or password mangling, on the client.
ja: しかし, この認証法は, クライアントで(ハードウェアのドライバやパスワードマングリングのような)特別なコードを必要としない認証メカニズムに制限される.

source: Values of this Textual Convention might not be directly usable as transport-layer addressing information and may require runtime resolution.
ja: このテキスト表記の値は, トランスポート層のアドレス情報として直接利用できない場合があり, 実行時の解決が必要な可能性がある.

source: The value for 'dss_signature_blob' is encoded as a string containing r, followed by s (which are 160-bit integers, without lengths or padding, unsigned, and in network byte order).
ja: 'dss_signature_blob' の値は, (それぞれ長さやパディングがない符号無しのネットワークバイトオーダーの160-bitの整数である) r とそれに続く s を含む文字列としてエンコードされる.

source: Note that the values for the 'reason code' are given in decimal format for readability, but they are actually uint32 values.
ja: 'reason code' は読み易いように10進のフォーマットで書かれているが, 実際にはuint32の値であることに注意.

source: Confidentiality ....................................14 9.3.2.
ja: 機密性....................................14 9.3.2.

source: o If the key exchange fails due to a GSS-API error returned from the server's call to GSS_Accept_sec_context(), and an "error token" is also returned, then the server SHOULD send the error token to the client to allow completion of the GSS security exchange.
ja: o GSS_Accept_sec_context() のサーバの呼び出しから GSS-APIエラーが返ったために鍵交換が失敗しまた"エラートークン"も返されたならば, サーバはクライアントに GSSセキュリティ交換の完了を許可するためにエラートークンを送る必要がある.

source: The stateful-decryption counter mode methods in Section 4 are, however, the preferred alternatives to the insecure methods in [RFC4253] because stateful-decryption counter mode is the most efficient (in terms of both network consumption and the number of required cryptographic operations per packet).
ja: しかし, 4節のステートフル-復号 カウンターモード法が[RFC4253]の危険な方法の好ましい代替だ. ステートフル-復号カウンターモードが(ネットワーク消費とパケットごとに必要な暗号操作の数の両方で)もっとも効率的だからだ.

source: IV and Counter Management
ja: IV とカウンタの管理

source: Since the sender of a message initiates the creation of an SSH session if needed, the SSH session will already exist for an incoming message; otherwise, the incoming message would never reach the SSH Transport Model.
ja: メッセージの送り手が必要に応じて SSH のセッションの作成を開始するので, SSH のセッションは, 入力メッセージに対してすでに存在している. そうでなければ, 受信メッセージは SSH トランスポートモデルに到達しない.

source: o If the client's reference identifier is an IP address as defined by [RFC0791] or [RFC2460], the client SHOULD convert that address to the "network byte order" octet string representation and compare it against a subjectAltName entry of type iPAddress.
ja: o クライアントの参照識別子が [RFC0791] ないし [RFC2460] で定義された IP アドレスならば, クライアントはそのアドレスを"ネットワークバイトオーダー" オクテット文字列表現に変換し iPAddress タイプの subjectAltName エントリに対して比較する必要がある.

source: This message does not consume window space and can be sent even if no window space is available.
ja: このメッセージは, window space を消費しない. window space が残っていない場合にも送ることができる.

source: In this protocol, all algorithm and method identifiers MUST be printable US-ASCII, non-empty strings no longer than 64 characters.
ja: このプロトコルでは, すべてのアルゴリズムと方式の識別子は, 表示可能なUS-ASCIIで64文字以下の空でない string でなければならない.

source: Identify an SSH session over which to send the messages:
ja: メッセージを送るSSHセッションを識別する:

source: This field is used to store the login-name that the key was generated under.
ja: このフィールドは, 鍵が生成された環境のログイン名を保持するのに利用される.

source: When present, such messages typically relate to errors, debugging information, or some externally configured data.
ja: 現在, これらのメッセージは典型的にはエラーやデバッグ情報, その他の外部で設定されるデータに関連している.

source: (Note that "blowfish-cbc" from [RFC4253] uses 128-bit keys.)
ja: (注意: [RFC4253]の "blowfish-cbc" は 128-bit鍵を用いる.)

source: Weak Transport .....................................21 9.4.2.
ja: 弱いトランスポート ..................................21 9.4.2.

source: This protocol requires that the user be able to authenticate in some fashion before it can be used.
ja: このプロトコルは, ユーザが利用する前に何らかの形でユーザを認証できる必要がある.

source: In any event, where local security policy for the server host exists, it MUST be applied and enforced correctly.
ja: とにかく, サーバホストにローカルなセキュリティポリシーがあるなら, 正しく適用/実施されなければならない.

source: However, key exchange methods with implicit server authentication MAY be used with this protocol.
ja: しかし, 暗黙のサーバ認証を用いる鍵交換法をこのプロトコルで用いてもよい.

source: Exiting the NETCONF Subsystem ...................................6 6.
ja: NETCONF サブシステムの終了 .................................6 6.

source: Symbolic Name reason code ------------- ----------- SSH_OPEN_ADMINISTRATIVELY_PROHIBITED 1 SSH_OPEN_CONNECT_FAILED 2 SSH_OPEN_UNKNOWN_CHANNEL_TYPE 3 SSH_OPEN_RESOURCE_SHORTAGE 4
ja: シンボル名 reason code ------------- ----------- SSH_OPEN_ADMINISTRATIVELY_PROHIBITED 1 SSH_OPEN_CONNECT_FAILED 2 SSH_OPEN_UNKNOWN_CHANNEL_TYPE 3 SSH_OPEN_RESOURCE_SHORTAGE 4

source: Conceptually, the SSH Transport layer encodes messages sent by the Messages layer, and decodes messages received on the SSH channel before passing them to the Messages layer.
ja: 概念的には, SSH トランスポート層は, Messages 層から送られたメッセージをエンコードし, SSH チャンエルから受信したメッセージを Messages 層に送る前にデコードする.

source: In particular, this document defines the following public key algorithms, which differ from the above solely in their use of X.509v3 certificates to convey the signer's public key.
ja: 特に, この文書は以下の公開鍵アルゴリズムを定義する. 上の表のものとは署名者の公開鍵を伝達するのに X.509v3 証明書を用いるところのみが異なっている.

source: If an extension to SSH were to use K directly and to assume that it had been generated by Diffie-Hellman key exchange, this could produce a security weakness.
ja: SSHの拡張が, K を直接用い K が Diffie-Hellman 鍵交換で生成されることを仮定していると, セキュリティの弱点を作る可能性がある.

source: For more details, see the paper by van Oorschot and Wiener [VAN-OORSCHOT].
ja: より詳細には, van Oorschot と Wiener の論文 [VAN-OORSCHOT] を参照せよ.

source: Security Considerations .......................................14 12.
ja: セキュリティの考察.......................................14 12.

source: To send notifications over SSHTM, the internetworking device will need to be configured as an SSH client.
ja: SSHTM 越しに通知を送るには, インターネットで動作するデバイスは, SSHクライアントとして設定されている必要がある.

source: This operation SHOULD be supported by any general purpose SSH client.
ja: この操作を, 一般的な目的のSSHクライアントはサポートする必要がある.

source: In the example, there is a chain of certificates of length 2, and a single OCSP response is provided.
ja: 例では, 証明書のチェーンの長さは 2 で, 1つの OCSP 応答が提供されている.

source: Either the server or client may at any time request that the secure shell session be rekeyed.
ja: サーバもクライアントも, セキュアシェルセッションで鍵の再生成の要求をいつでも行う可能性がある.

source: By convention, a number that is used in modular computations in Z_n SHOULD be represented in the range 0 <= x < n.
ja: 慣習により, Z_nのモジュラ計算に利用される数は, 0 <= x < n の範囲で表現される必要がある.

source: Channel-Specific Requests
ja: チャンネル特有の要求

source: Implementations may need to cache the transportAddress passed to the openSession API for later use when performing incoming message processing (see Section 5.1).
ja: 実装は, (5.1節の) 受信メッセージ処理の実行の時に後で使うため, openSession API に渡す transportAddress をキャッシュする必要があるだろう.

source: The algorithm for key pair generation can be found in Section 3.2.1 of [SEC1].
ja: 鍵ペア生成のアルゴリズムは, [SEC1]の 3.2.1 節にある.

source: The block size is 8 bytes.
ja: ブロックサイズは 8byte だ.

source: If the client wishes to remove a public key, the client sends:
ja: クライアントが公開鍵を削除したい場合, クライアントは以下を送る:

source: A NETCONF over SSH session consists of a NETCONF client and NETCONF server exchanging complete XML documents.
ja: SSHセッション上の NETCONF は, NETCONF クライアントと NETCONF サーバの完全な XML 文書の交換で構成される.

source: Protocol fields will be defined in the message definitions.
ja: メッセージの定義で, プロトコルのフィールドは定義される.

source: An invocation of AES GCM to perform an authenticated decryption has the following inputs and outputs:
ja: 認証付きの復号を実行する AES GCM の実行は, 次の入力と出力を持つ:

source: The transport layer will typically be run over a TCP/IP connection but might also be used on top of any other reliable data stream.
ja: トランスポート層は, 典型的には TCP/IP接続の上で動くことを想定しているが, 他の信頼できるデータストリームの上で使ってもよい.

source: Later protocol versions may define other meanings for these message types.
ja: プロトコルのより後のバージョンが, これらのメッセージタイプに別の意味を定義するかもしれない.

source: While hosts are often configured to be SSH clients, most
ja: ホストは頻繁にSSHクライアントとなるよう設定されているが, 多くのインターネットで動作するデバイスはそうではない.

source: The comment attribute must be specified in UTF-8 format [7].
ja: comment 属性は UTF-8 形式 [7] で指定しなければならない.

source: The Secure Shell Transport Model has specific responsibilities regarding the cached information.
ja: セキュアシェルトランスポートモデルは, キャッシュされる情報に関する特定の責任を持っている.

source: As discussed in Section 7.3, there is an incompatibility between GCM's requirement that no plaintext be returned until the authentication tag has been verified, secure shell's requirement that the packet length be encrypted, and the necessity of decrypting the packet length field to locate the authentication tag.
ja: 7.3 節で議論したように, 認証タグが検証されるまで平文を返さない GCM の要件と, packet length が暗号化され認証タグの位置を知るために packet length フィールドを復号する必要のあるセキュアシェルの要件は, 互換していない.

source: Public Key Algorithm Names ........................17 4.11.4.
ja: 公開鍵アルゴリズム名 ........................17 4.11.4.

source: The maximum length is thus L = (KLEN+7-2*HLEN-16)/8 = (KLEN-2*HLEN-9)/8.
ja: それゆえ, 最大長は, (KLEN+7-2*HLEN-16)/8 = (KLEN-2*HLEN-9)/8 だ(訳注: これも [RFC3447]による).

source: The integers r and s are the output of the ECDSA algorithm.
ja: 整数 r と s は ECDSA アルゴリズムの出力だ.

source: An SMI number (7) under snmpDomains, for the snmpSSHDomain.
ja: snmpSSHDomein のための snmpDomeins の下での SMI 番号 (7).

source: The IANA will not control the status code range of 192 through 255.
ja: IANAは, 192 から 255 の範囲のメッセージ番号は制御しない.

source: The remaining messages SHOULD be configurable.
ja: 残りのメッセージは, 設定可能とする必要がある.

source: 5 VEOF End-of-file character (sends EOF from the terminal).
ja: 5 VEOF End-of-file 文字 (ターミナルからEOFを送る).

source: The server responds to the SSH_MSG_USERAUTH_REQUEST with either an SSH_MSG_USERAUTH_FAILURE if none of the mechanisms are supported or with an SSH_MSG_USERAUTH_GSSAPI_RESPONSE as follows:
ja: SSH_MSG_USERAUTH_REQUEST に対してサーバは， どのメカニズムもサポートしていない場合にSSH_MSG_USERAUTH_FAILURE を返す． そうでなければ 次の SSH_MSG_USERAUTH_GSSAPI_RESPONSE を返す．

source: Names with the at-sign ("@") are locally defined extensions and are not controlled by the IANA.
ja: アットマーク("@") を持つ名前は, ローカルに定義された拡張で, IANAによって制御されない.

source: These issues are discussed further in [BKN1,BKN2].
ja: この問題については, [BKN1,BKN2]でより詳しく議論されている.

source: Compute shared secret.
ja: 共有の秘密の計算

source: It runs over the Transport Layer Protocol.
ja: このプロトコルはトランスポート層プロトコル上で動作する.

source: Protocol packets containing the SSH_MSG_CHANNEL_REQUEST message with a "pty-req" string MUST contain an 'encoded terminal modes' value.
ja: "ptr-req" string を含む SSH_MSG_CHANNEL_REQUEST メッセージを含むプロトコルのパケットは, "ptr-req" string を含む SSH_MSG_CHANNEL_REQUEST メッセージは, 'encoded terminal modes' の値を含まなければならない.

source: For a given block-cipher key BK, it is critical that no IV be used more than once.
ja: 与えられたブロック暗号鍵 BK に対して, 複数回同じ IV を利用しないことが重要だ.

source: 14 VLNEXT Enter the next character typed literally, even if it is a special character 15 VFLUSH Character to flush output.
ja: 14 VLNEXT 次に入力される文字が特別な文字だったとしてもその通りに入力する. 15 VFLUSH 出力を flush する文字

source: The meaning of the failure codes is as implied by their names.
ja: 失敗のコードの意味は, それらの名前に示されている.

source: The following describes the procedure to follow to establish a session between a client and server to run SNMP over SSH.
ja: SSH上のSNMP を実行する クライアントとサーバの間でセッションを確立する手順を以下で記述する.

source: The "user" portion may or may not match the tmSecurityName parameter passed from the Security Model.
ja: "user" 部分は, セキュリティモデルから渡される tmSecurityName パラメータと一致してもしなくてもよい.

source: Issues associated with the use of certificates (such as expiration of certificates and revocation of compromised certificates) are addressed in [RFC5280] and are outside the scope of this document.
ja: 証明書を利用する上での問題 (証明書の有効期限や信用できない証明書の失効)は [RFC5280] で述べられており, この文書の範囲外だ.

source: o MUST NOT advertise a maximum packet size that would result in transport packets larger than its transport layer is willing to receive.
ja: o トランスポート層が受信できるよりも大きなトランスポート packet になる最大 packet size を告知してはならない.

source: If a BREAK duration request of greater than 3000 ms is received, it SHOULD be interpreted as a request for a 3000 ms BREAK.
ja: 3000 ms を越える BREAK 持続時間の要求を受け取ったら, 3000 ms の BREAKと解釈される必要がある.

source: It is particularly important to note the definition of string allows binary content.
ja: 文字列の定義がバイナリの内容を許していることに注意することが特に重要だ.

source: Future Assignments .................................12 4.6.
ja: 将来の割り当て.................................12 4.6.

source: Therefore, we generate an ephemeral key and use that as both the clients keys.
ja: したがって, 1つの一時的鍵を生成し, それをあたかも2つのクライアント鍵のように利用する.

source: The status code gives the status in a more machine-readable format (suitable for localization), and can have the following values:
ja: 状態コードは, より機械可読な形式(ローカライズに適している)で状態を与える. 以下の値を取りうる:

source: Implementations should only allow forwarding privileged ports if the user has been authenticated as a privileged user.
ja: 実装は, ユーザが特権ユーザとして認証されている場合にのみ特権ポートの転送を許すようにする必要がある.

source: If the MAC algorithm has a vulnerability or is weak enough, then the attacker may be able to specify certain inputs to yield a known MAC.
ja: MACのアルゴリズムに脆弱性があったり弱い場合, 攻撃者は既知のMACの値を生成する入力を特定できるかもしれない.

source: Security Considerations ........................................17 6.
ja: セキュリティの考察 ........................................17 6.

source: The GSS_GetMIC call MUST be applied over H, not the original data.
ja: GSS_GetMIC の呼び出しは 元データではなく Hに対して適用されなければならない.

source: In a case where an SSH connection cascades to another connection, the BREAK SHOULD be passed along the cascaded connection.
ja: SSHの接続が別の接続にカスケードされている場合は, BREAKはカスケードされた接続に渡される必要がある.

source: This memo describes a Transport Model for the Simple Network Management Protocol, using the Secure Shell (SSH) protocol [RFC4251] within a Transport Subsystem [RFC5590].
ja: このメモは, トランスポートサブシステム [RFC5590] を セキュアシェル (SSH) プロトコル [RFC4251] で用いる, シンプルネットワークマネジメントプロトコルのためのトランスポートモデルを記述する.

source: Compression
ja: 圧縮

source: The symmetric portion of the SSH Transport Protocol was designed to provide both privacy and integrity of encapsulated data.
ja: SSH トランスポートプロトコルの対称部分は, カプセル化されたデータの秘匿と完全性を提供するために設計されている.

source: These are described in [SSH-TRANS].
ja: これらは, [SSH-TRANS]で記述されている.

source: In this case, we recommend that SSH implementations check the host key against a local database before verifying the key via the fingerprint returned from DNS.
ja: この場合, DNSから返される指紋による鍵の検証の前にローカルなデータベースに対するホスト鍵の検証をSSHの実装がすることを推奨する.

source: The "diffie-hellman-group-exchange-sha256" method specifies Diffie-Hellman Group and Key Exchange with SHA-256 [FIPS-180-2] as HASH.
ja: "diffie-hellman-group-exchange-sha256" 法は, SHA-256 [FIPS-180-2] を HASH として用いる Diffie-Hellman 群と鍵交換を指定する.

source: The maximum length of the string is 255 characters, including the Carriage Return and Line Feed.
ja: 文字列の最大長は, 255文字だ. これには キャリッジリターンとラインフィードを含む.

source: This method indicates that the key is an RSA-key.
ja: この方法は, 鍵がRSA鍵であることを示している.

source: The Authentication Protocol Framework ...........................4 5.
ja: 認証プロトコルのフレームワーク...........................4 5.

source: Note that this problem occurs regardless of how secure the underlying encryption method is.
ja: 注意; 基底の暗号法の安全性に関係なくこの問題はおこる.

source: The RSA key-exchange method has the following parameters:
ja: RSA 鍵交換法は, 以下のパラメータを持つ.

source: 10 Appendix A. Changes from RFC 4742 .
ja: 10 Appendix A. RFC 4742 からの変更点 .
